import 'package:flutter/material.dart';

import '../core/widgets/bg_screen.dart';

class SontSwaak extends StatelessWidget {
  SontSwaak({super.key});
  static const String routename="sowaak";

  Widget build(BuildContext context) {
    return BgScreen(child:
    Scaffold(
        backgroundColor: Colors.transparent,
        appBar: AppBar(
          foregroundColor: Colors.white,
          backgroundColor: Colors.transparent,
          elevation: 0,
          title: Text("فضل سنه السواك",style: TextStyle(fontSize: 30,color: Colors.white),),
          centerTitle: true ,
        ),
        body: Padding(
          padding: const EdgeInsets.all(8.0),
          child: ListView(
            children: [
              Container(
                child: Text(
                  """

• عَنْ أَبِي هُرَيْرَةَ رضي الله عنه عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: "لَوْلاَ أَنْ أَشُقَّ عَلَى الْمُؤْمِنِينَ لأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلاَةٍ".

وفي رواية: "عَلَى أُمَّتِي". وفي رواية البخاري: "عَلَى النَّاس".

• وعن عائشة رضي الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا دَخَلَ بَيْتَهُ بَدَأَ بِالسِّوَاكِ. رواه مسلم.

• وعَنْ أَبِي مُوسَى رضي الله عنه قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَطَرَفُ السِّوَاكِ عَلَى لِسَانِهِ.

وفي رواية البخاري: فوجَدْتُه يَسْتَن بسِواكٍ بيدِه يقولُ: "أُعْ، أُعْ" والسواكُ في فِيهِ كأنَّه يَتهوَّعُ.

• وعَنْ حُذَيْفَةَ أَنَّ رَسُولِ اللّهِ صلى الله عليه وسلم كَانَ إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ. وفي رواية: إِذَا قَامَ لِيَتَهَجَّدَ.

الفائدة الأولى: السواك سنة ونقل الإجماع النووي، وحكي عن داود الظاهري وجوبه وعن إسحاق بن راهويه شرطيته وأنها تبطل الصلاة إذا لم يستك، ولكن لا يصح هذا المحكي عنه.

 

الفائدة الثانية: حث النبي صلى الله عليه وسلم على السواك في أحاديث كثيرة حتى قال كما جاء عند البخاري من حديث أنس رضي الله عنه: " أكثرت عليكم في السواك ".

 

الفائدة الثالثة: السواك سنة في كل وقت على القول الصحيح للصائم وغيره سواءً قبل الزوال أو بعده. لحديث عائشة رضي الله عنها: " السواك مطهرة للفم مرضاة للرب ".

ووجه الدلالة: أنه لم يحدد وقتاً فإذا احتاج المسلم إلى تطهير فمه فله أن يستاك في أي وقت، وكذلك حديث الباب: " لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة " والصلوات منها ما هو قبل الزوال ومنها ما هو بعده.

وأما حديث علي رضي الله عنه أن النبي صلى الله عليه وسلم قال: " إذا صمتم فاستاكوا بالغداة ولا تستاكوا بالعشي " فهو

حديث ضعيف لأنّ مداره على أبي عمر كيسان القصار وهو رجل ضعيف لا يحتج به، وقال العراقي [انظر:" شرح الترمذي"].

عن هذا الحديث بأنه حديث ضعيف جداً، فهو حديث ضعيف موقوفاً ومرفوعاً.

 

الفائدة الرابعة: السّواك سنّة في كل وقت ويتأكد في مواضع:

1- عندكل صلاة لحديث أبي هريرة رضي الله عنه وهو حديث الباب" لولا أنْ أشق على أمتي لأمرتهم بالسواك عند كل صلاة "متفق عليه.

 

2- عند الوضوء ومحله عند المضمضة لحديث أبي هريرة رضي الله عنه " لولا أن أشق على أمتي لأمرتهم بالسواك مع كل وضوء " رواه أحمد وابن خزيمة ورواه البخاري تعليقاً.

 

3- عند تغير رائحة الفم لحديث عائشة رضي الله عنها: " السواك مطهرة للفم مرضاة للرب ".

 

4- عند قراءة القرآن لحديث علي رضي الله عنه: " إن أفواهكم طرق القرآن فطيبوها بالسواك " رواه ابن ماجه والبزار، وهذا الحديث ضعيف لأن فيه انقطاعاً بين سعيد بن جبير وعلي بن أبي طالب رضي الله عنهم، وضعفه أبو حاتم وأكثر العلماء على تضعيفه، وقال البوصيري [انظر:" الزوائد"]: ضعيف للانقطاع بين سعيد وعلي وضعف راويه بحر.

ولكن استحسن بعض العلماء السواك عند قراءة القرآن و أنه من آدابه وعلى كل حال يدخل في عموم سنية السواك في كل وقت، وأما عند قراءة القرآن على وجه التخصيص فالحديث ضعيف والله أعلم.

 

5- عند الانتباه من النوم لحديث حذيفة رضي الله عنه: " كان النبي صلى الله عليه وسلم إذا قام من النوم يشوص فاه بالسواك " متفق عليه.

وقيل إن هذا مخصوص بقيام الليل لرواية مسلم " إذا قام من الليل " ورواية أخرى " إذا قام ليتهجد " وعلى كل حال فأن الإنسان إذا قام من أي نوم فإن رائحة فمه تتغير فنستدل بحديث عائشة - رضي الله عنها - السابق.

 

6- عند دخول المنزل لحديث الباب حديث عائشة - رضي الله عنها - عند مسلم:"أنّ النبي صلى الله عليه وسلم كان إذا دخل بيته بدأ بالسواك ".

 

الفائدة الخامسة: يستحب البداءة في السواك من الجانب الأيمن لحديث عائشة - رضي الله عنها - أنّ النبي صلى الله عليه وسلم: " كان يعجبه التيمن في تنعله وترجله وطهوره وفي شأنه كله " متفق عليه.

قال المرداوي عن البداءة في الاستياك من الجانب الأيمن: " مستحب بلا نزاع " انظر:" الإنصاف"( 1/ 55).

 

الفائدة السادسة: الأفضل أن يكون الاستياك بعود الأراك، وبأي شيء استاك من الأعواد تحصل به السنية، وأما الاستياك بالأصبع فيجزئ إن لم يكن عنده عيدان يستاك بها وهو اختيار شيخنا ابن عثيمين رحمه الله.

 

الفائدة السابعة: قيل من الحكم في الاستياك عند دخول المنزل أن النبي صلى الله عليه وسلم كان يتهيأ لزوجاته.

 

الفائدة الثامنة: حديث أبي موسى رضي الله عنه يدل على أن السواك يكون أيضاً على اللسان بشكل طولي وذلك إذا احتاج له الإنسان.

وجاء عند البخاري" وطرف السواك على لسانه يقول أُع أُع "وجاء في رواية أخرى عند البخاري: " كأنه يتهوع " أي: يتقيأ.

 

الفائدة التاسعة: أخذ من حديث " لولا أن أشق على أمتي.... " قاعدة [درء المفاسد مقدم على جلب المصالح] فهنا قدم النبي صلى الله عليه وسلم درء المفسدة وهي عدم استطاعتهم على السواك لو كان واجباً على جلب المصلحة وهي فوائد السواك لو أمر به.



                         -------------

      
""",
                  style: TextStyle(fontSize: 25,color: Colors.white,fontWeight: FontWeight.w700),
                ),
              )
            ],
          ),
        )
    ),
    );
  }
}